GroggyAlgorithm/HalBuilder/Examples/GeneratedHeaders/attiny25Pins.h
/**
* \file attiny25Pins
* \author Auto Hal Builder, Tim Robbins
* \date 2023-09-26 12:38:16.912354
* \brief Auto Generated Definitions 
*
*/
#ifndef ATTINY25PINS_H_
#define ATTINY25PINS_H_ 1




#define ADC0_CHANNEL                    0
#define PB5_PERIPHERAL_0                0
#define ADC0_CHANNEL_PIN                B, 5
#define PB5_PIN                         B, 5
#define PIN_0                           B, 5
#define INT5_PIN                        B, 5
#define RESET_PIN                       B, 5
#define ADC0_PIN                        B, 5
#define dW_PIN                          B, 5

#define ADC3_CHANNEL                    3
#define PB3_PERIPHERAL_0                3
#define ADC3_CHANNEL_PIN                B, 3
#define PWM_1B                          OCR1B
#define PB3_PERIPHERAL_1                OCR1B
#define PWM_1B_PIN                      B, 3
#define PB3_PIN                         B, 3
#define PIN_1                           B, 3
#define INT3_PIN                        B, 3
#define XTAL1_PIN                       B, 3
#define CLKI_PIN                        B, 3
#define OC1B_PIN                        B, 3
#define ADC3_PIN                        B, 3

#define ADC2_CHANNEL                    2
#define PB4_PERIPHERAL_0                2
#define ADC2_CHANNEL_PIN                B, 4
#define PB4_PIN                         B, 4
#define PIN_2                           B, 4
#define INT4_PIN                        B, 4
#define XTAL2_PIN                       B, 4
#define CLKO_PIN                        B, 4
#define OC1B_PIN                        B, 4
#define ADC2_PIN                        B, 4

#define ADC1_CHANNEL                    1
#define PB2_PERIPHERAL_0                1
#define ADC1_CHANNEL_PIN                B, 2
#define PB2_PIN                         B, 2
#define PIN_3                           B, 2
#define SCK_PIN                         B, 2
#define USCK_PIN                        B, 2
#define SCL_PIN                         B, 2
#define ADC1_PIN                        B, 2
#define T0_PIN                          B, 2
#define INT0_PIN                        B, 2
#define INT2_PIN                        B, 2

#define PWM_0B                          OCR0B
#define PB1_PERIPHERAL_0                OCR0B
#define PWM_0B_PIN                      B, 1
#define PWM_1A                          OCR1A
#define PB1_PERIPHERAL_1                OCR1A
#define PWM_1A_PIN                      B, 1
#define PB1_PIN                         B, 1
#define PIN_4                           B, 1
#define MISO_PIN                        B, 1
#define DO_PIN                          B, 1
#define AIN1_PIN                        B, 1
#define OC0B_PIN                        B, 1
#define OC1A_PIN                        B, 1
#define INT1_PIN                        B, 1

#define PWM_0A                          OCR0A
#define PB0_PERIPHERAL_0                OCR0A
#define PWM_0A_PIN                      B, 0
#define PB0_PIN                         B, 0
#define PIN_5                           B, 0
#define MOSI_PIN                        B, 0
#define DI_PIN                          B, 0
#define SDA_PIN                         B, 0
#define AIN0_PIN                        B, 0
#define OC0A_PIN                        B, 0
#define OC1A_PIN                        B, 0
#define AREF_PIN                        B, 0
#define INT0_PIN                        B, 0



//Adc Definitions


//Pwm Definitions



#endif